<!doctype html><html lang=en-us><head><meta charset=utf-8><meta name=viewport content="width=device-width,initial-scale=1"><title>A Foray For Fun into Windows Fibers — ~/wired/</title><link rel=preconnect href=https://fonts.googleapis.com><link rel=preconnect href=https://fonts.gstatic.com crossorigin><link rel=stylesheet href=/css/styles.css><script>document.documentElement.classList.add("js")</script></head><body><canvas id=spacefield aria-hidden=true></canvas>
<script src=/js/spacefield.js defer></script><div class=wrap><header class=site><nav class=topnav><a class=homebtn href=/ title=Home>cd ~</a></nav><div class=prompt>mike@malicious.dev:~$</div><h1>~/wired/</h1><p class=post-meta>Random Technical Posts and Curios</p></header><main role=main><article class=term id=post-term><div class=term-bar><span class=term-title><b>mike@malicious.dev</b>: ~/posts/fibers</span></div><div class=term-body><div id=post-boot class=boot aria-hidden=true></div><div id=post-content><header><h2 class=post-title>A Foray For Fun into Windows Fibers</h2><div class=post-meta>2021-01-01 · 20 min read</div></header><div class=content><p>The Windows fiber API has been described as one of the &ldquo;most elegant&rdquo; APIs available to the Windows programmer for manual execution scheduling.
I&rsquo;m by no means an expert in how fibers work, nor how to deploy them into a large-scale application.

</span></span><span style=display:flex><span>    Teb<span style=color:#f92672>-&gt;</span>NtTib.FiberData <span style=color:#f92672>=</span> Fiber;
</span></span><span style=display:flex><span>    Teb<span style=color:#f92672>-&gt;</span>HasFiberData <span style=color:#f92672>=</span> TRUE; <span style=color:#75715e>// what we really care about
</span></span></span><span style=display:flex><span><span style=color:#75715e></span>
</span></span><span style=display:flex><span>    <span style=color:#75715e>/* Return opaque fiber data */</span>
</span></span><span style=display:flex><span>    <span style=color:#66d9ef>return</span> (LPVOID)Fiber; <span style=color:#75715e>// MSDN says this is a pointer to the fiber, rather than the fiber object
</span></span></span><span style=display:flex><span><span style=color:#75715e></span>    <span style=color:#75715e>// HMMMMMMM    
</span></span></span><span style=display:flex><span><span style=color:#75715e></span>     
</span></span><span style=display:flex><span>}
</span></span></code></pre></div><p>Compare this with the disassembly of KernelBase!ConvertThreadToFiberEx</p><pre tabindex=0><code>KERNELBASE!ConvertThreadToFiber:
00007ffc`cdd58160 48895c2408         mov     qword ptr [rsp+8], rbx ss:000000c4`533bf970={FiberBlog!_NULL_IMPORT_DESCRIPTOR  (FiberBlog+0x22015) (00007ff6`49e62015)}
00007ffc`cdd58165 4889742410         mov     qword ptr [rsp+10h], rsi
00007ffc`cdd5816a 57                 push    rdi
00007ffc`cdd5816b 4883ec20           sub     rsp, 20h
00007ffc`cdd5816f 65488b3c2530000000 mov     rdi, qword ptr gs:[30h] 
; rdi gets a pointer to the current _NT_TIB

. . .
 T R U N C A T E D 
. . .


00007ffc`cdd58252 66838fee17000004   or      word ptr [rdi+17EEh], 4
; Setting the Teb-&gt;HasFiberData flag to True



00007ffc`cdd5825a 48895720           mov     qword ptr [rdi+20h], rdx
; Setting Teb-&gt;FiberData

00007ffc`cdd5825e 488b742438         mov     rsi, qword ptr [rsp+38h]
00007ffc`cdd58263 488bc3             mov     rax, rbx
00007ffc`cdd58266 488b5c2430         mov     rbx, qword ptr [rsp+30h]
00007ffc`cdd5826b 4883c420           add     rsp, 20h
00007ffc`cdd5826f 5f                 pop     rdi
00007ffc`cdd58270 c3                 ret 
</code></pre><p>The behavior is, for all semantic purposes, identical. Thank you ReactOS team :)
So what&rsquo;s the deal with the TEB and TIB?
WELL, I&rsquo;m glad you asked.</p><p>Let&rsquo;s take the two instructions from the disassembly and check to see what offsets they&rsquo;re referencing.
(rdi == TEB)</p><pre tabindex=0><code>00007ffc`cdd58252 66838fee17000004   or      word ptr [rdi+17EEh], 4
; Setting the Teb-&gt;HasFiberData flag to True

00007ffc`cdd5825a 48895720           mov     qword ptr [rdi+20h], rdx
; Setting Teb-&gt;FiberData
</code></pre><p>Examining the TEB structure, we find that the WORD referenced by *(rdi+0x17ee) actually represents bit flags for different features in the process.</p><pre tabindex=0><code>0:000&gt; dt nt!_TEB
ntdll!_TEB
    +0x17ee SameTebFlags     : Uint2B
    +0x17ee SafeThunkCall    : Pos 0, 1 Bit
    +0x17ee InDebugPrint     : Pos 1, 1 Bit
    +0x17ee HasFiberData     : Pos 2, 1 Bit ; &#34;or word ptr [rdi+17EEh], 4&#34; sets this to TRUE 
    +0x17ee SkipThreadAttach : Pos 3, 1 Bit
    +0x17ee WerInShipAssertCode : Pos 4, 1 Bit
    +0x17ee RanProcessInit   : Pos 5, 1 Bit
    +0x17ee ClonedThread     : Pos 6, 1 Bit
    +0x17ee SuppressDebugMsg : Pos 7, 1 Bit
    +0x17ee DisableUserStackWalk : Pos 8, 1 Bit
    +0x17ee RtlExceptionAttached : Pos 9, 1 Bit
    +0x17ee InitialThread    : Pos 10, 1 Bit
    +0x17ee SessionAware     : Pos 11, 1 Bit
    +0x17ee LoadOwner        : Pos 12, 1 Bit
    +0x17ee LoaderWorker     : Pos 13, 1 Bit
    +0x17ee SkipLoaderInit   : Pos 14, 1 Bit
    +0x17ee SpareSameTebBits : Pos 15, 1 Bit
</code></pre><p>We can also see that the QWORD PTR referenced by *(rdi+0x20) is a FiberData pointer in the process&rsquo; TIB.</p><pre tabindex=0><code>0:000&gt; dt nt!_NT_TIB
ntdll!_NT_TIB
    +0x000 ExceptionList    : Ptr64 _EXCEPTION_REGISTRATION_RECORD
    +0x008 StackBase        : Ptr64 Void
    +0x010 StackLimit       : Ptr64 Void
    +0x018 SubSystemTib     : Ptr64 Void
    +0x020 FiberData        : Ptr64 Void ; This is what GetFiberData fetches
    +0x020 Version          : Uint4B
    +0x028 ArbitraryUserPointer : Ptr64 Void
    +0x030 Self             : Ptr64 _NT_TIB
</code></pre><p>Neat. So our FiberData pointer and HasFiberData flag both live in the TEB.
One could define a GetFiberData macro essentially as a few intrinsic functions equivalent to:</p><div class=highlight><pre tabindex=0 style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-C++ data-lang=C++><span style=display:flex><span><span style=color:#66d9ef>void</span><span style=color:#f92672>*</span> <span style=color:#a6e22e>GetFiberData</span>(){
</span></span><span style=display:flex><span>    <span style=color:#75715e>#ifdef _WIN64
</span></span></span><span style=display:flex><span><span style=color:#75715e></span>    <span style=color:#66d9ef>return</span> __readgsqword(<span style=color:#ae81ff>0x20</span>) <span style=color:#75715e>// mov rax, gs:[20]
</span></span></span><span style=display:flex><span><span style=color:#75715e></span>    <span style=color:#75715e>#else
